Revit 2027 API
IExportContext2D Methods
The IExportContext2D type exposes the following members.
Methods
Name | Description
OnCurve |  This method is called when a Curve is being output.
(Inherited from IExportContextBase)
OnElementBegin2D |  This method marks the beginning of an element to be exported.
OnElementEnd2D |  This method marks the end of an element being exported.
OnFaceEdge2D |  This method is called when a Face edge is being output.
OnFaceSilhouette2D |  This method is called when a Face silhouette is being output.
OnLineSegment |  This method is called after unhandled curve was tessellated to line segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
(Inherited from IExportContextBase)
OnPolyline |  This method is called when a Polyline is being output.
(Inherited from IExportContextBase)
OnPolylineSegments |  This method is called after unhandled curve was tessellated to polyline segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
(Inherited from IExportContextBase)
OnText |  This method is called when a text annotation object is being output.
(Inherited from IExportContextBase)
Top
See Also
Reference
IExportContext2D Interface
Autodesk.Revit.DB Namespace